benchmarking/benchmark-integration-wrk/src/test/resources/wrk-jwt-results.txt
=== BENCHMARK METADATA ===
benchmark_name: jwt-validation
start_time: 1758797251
start_time_iso: 2025-09-25T12:47:31+02:00
=== WRK OUTPUT ===

Loaded 100 tokens from environment
Loaded 100 tokens from environment
Loaded 100 tokens from environment
[...]
Running 5s test @ https://localhost:10443/jwt/validate
  4 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.33ms    6.30ms  42.53ms   87.28%
    Req/Sec     2.16k   283.91     2.54k    85.00%
  Latency Distribution
     50%    1.73ms
     75%    2.97ms
     90%   14.05ms
     99%   28.27ms
  43069 requests in 5.01s, 11.13MB read
Requests/sec:   8592.89
Transfer/sec:      2.22MB

=== BENCHMARK COMPLETE ===
end_time: 1758797257
end_time_iso: 2025-09-25T12:47:37+02:00
duration_seconds: 6